{
  "title": "Wild Sync 功能簡介",
  "sections": {
    "auth": {
      "title": "-註冊 / 登入功能-",
      "step1": "訪客可以藉由導覽列的使用者下拉選單，選擇「登入」或是「註冊」。",
      "step2": "輸入信箱、暱稱，並且重複輸入密碼已註冊，註冊完成後會跳轉至首頁。",
      "step3": "若已經註冊過，可以直接輸入信箱、密碼登入，登入後會跳轉至首頁。"
    },
    "home": {
      "title": "首頁瀏覽",
      "desc1": "熱門活動地點會依據縣市的活動數量，推薦最多的六個縣市區域。",
      "desc2": "活動列表會列出所有活動，可以利用左上角的篩選器選擇排序方式、難度、時間與地點。",
      "desc3": "右上角的顯示方式提供卡片與清單兩種顯示方式。",
      "desc4": "目前活動僅提供\"登山\"一種活動，其他活動選擇目前無實裝。"
    },
    "search": {
      "title": "搜尋功能",
      "desc1": "透過導覽列的搜索欄或是\"活動列表\"，可以進入搜尋頁面。",
      "desc2": "搜尋頁面可以利用關鍵字搜尋，同時利用篩選器篩選排序方式、難度、時間與地點。",
      "desc3": "搜尋頁面右邊會列出近期查看過的五個活動。"
    },
    "activity": {
      "title": "瀏覽活動資訊",
      "desc1": "活動資訊頁面上半部可以看到活動的重要資訊、包含時間、地點、簡介以及難度、時長、預估費用以及人數限制等。",
      "desc2": "右手邊的「活動參加者」欄位，可以看到目前活動的主辦人與參加者。",
      "desc3": "如有登入，則可以使用收藏活動、報名加入功能，加入後可在使用者資訊頁瀏覽。",
      "desc4": "活動資訊頁面的下半部能夠看到戶外活動的詳細細節、交通住宿資訊、行程安排等。",
      "desc5": "活動資訊業面的最後也有瀏覽紀錄欄位，可供使用者查看近期的五個活動瀏覽紀錄。"
    },
    "user": {
      "title": "瀏覽使用者資訊",
      "desc1": "使用者頁面可以查看特定使用者基本資訊，包含信箱、地區、年紀、職業、自我介紹等。",
      "desc2": "另外下面也可以查看使用者參與、收藏以及主辦過的活動清單。",
      "desc3": "右半邊的「熱門主辦者」欄位，會從資料庫中推薦出舉辦最多活動的 10 位使用者。"
    },
    "create": {
      "title": "建立活動 (需要登入)",
      "desc1": "登入後，透過導覽列右上角、使用者旁邊的「+」符號，即可進入建立活動視窗。",
      "desc2": "目前預設所有資料皆須填寫，若有空白會顯示警告並阻擋使用者前往下一步。",
      "desc3": "為避免誤觸關閉，關掉建立活動視窗後資料會保留，如要清空可透過視窗右上的「清空填入資料」清空重填。",
      "desc4": "五個步驟的所有資料都填寫完成後，會自動跳轉至新建立的活動頁面。"
    },
    "update": {
      "title": "更新活動與移除參與者 (需要登入)",
      "desc1": "前往使用者所舉辦的活動頁面，可以利用簡介下方的更新活動按鈕，進入更新活動視窗。",
      "desc2": "使用方式大致與活動建立視窗相同。另外若想取消更改可以利用視窗右上角的「還原變更」還原活動資訊。",
      "desc3": "若想要刪除活動，可以利用右上角的「刪除活動」刪除，會有警示的彈出視窗彈出確認是否要刪除。",
      "desc4": "身為主辦人，則在參與者卡片上會有移除按鈕，能夠移除已經參與的其他使用者。"
    },
    "editUser": {
      "title": "更新使用者公開資訊 (需要登入)",
      "desc1": "於自己的使用者頁面，可以透過「更新資料」來進入「編輯使用者資料視窗」。",
      "desc2": "可以透過使用者資料視窗來更新會公開的封面照片、大頭貼、名稱、生日、職業、地區與自我介紹。",
      "desc3": "若不想更新，可利用右下角的「取消更新」移除變更並關閉視窗。"
    },
    "account": {
      "title": "更新帳戶資訊 (需要登入)",
      "desc1": "利用導覽列的使用者下拉選單中的「帳戶設定」，可以進入「編輯帳戶資訊視窗」。",
      "desc2": "這邊可以重設使用者名稱、信箱以及密碼。因為涉及敏感資訊，因此在按下「更新帳戶」後會需要輸入員密碼以更新。"
    },
    "logout": {
      "title": "登出功能 (需要登入)",
      "desc1": "利用導覽列的使用者下拉選單中的「帳戶登出」，即可登出並重置當前畫面。"
    }
  }
}
